{
  "Home": "Strona Główna",
  "Skills": "Umiejętności",
  "Experience": "Doświadczenie",
  "My Projects": "Moje projekty",
  "About me": "O mnie",
  "Contact": "Kontakt",
  "Soft": "Miękkie",
  "Experienced:": "Doświadczony:",
  "Competent:": "Kompetentny:",
  "Basics:": "Podstawy:",
  "Slightly:": "Śladowo:",
  "perfect knowledge of": "perfekcyjna znajomość",
  "very good knowledge of": "bardzo dobra znajomość",
  "fluent knowledge of DTP principles,": "doskonała znajomość zasad DTP,",
  "fluent knowledge of work environment on the Windows.": "doskonała znajomość pracy na środowisku Windows.",
  "now": "teraz",
  "Intern Frontend Developer at Inetum": "Starzysta Frontend Developer w Inetum",
  "Implemetation of new modules.": "Implementacja nowych modułów.",
  "Adding logic for proper display with colaboration of old components.": "Dodawania logiki w celu poprawnego wyświetlania ze starymi komponentami.",
  "Fixing old and new bugs that happend in process of implement.": "Naprawa starych i nowych bugów wynikałych w procesie implementacji.",
  "Joining API with UI.": "Łączenie API z UI.",
  "DTP Specialist at Lionbridge": "Specjalista DTP wLionbridge",
  "Preparation the file to find text errors such as: bad formatting, double space, no dots, breaking lines with shift-enter and etc.": "Przygotowanie plików pod kątem znalezienia jak największej ilości błędów takich jak: złe formatowanie, podwójne spacje, brak kropek, shift-enter w środku zdania itp.",
  "The post-production of the file, which includes some of the steps of preparing and checking that text is in proper place, has good seperators, quote marks or isn't hiding in text frames.": "Post-produkcja pliku, czyli sprawdzenie czy tekst jest przetłumaczony, czy nie jest schowany w ramce tekstowej oraz czy ma dobre separatory, cudzosłowia itp.",
  "Making OCR files from none editable source into ID, AI, PS, Word, Power Point.": "Rekonstrukcja pliku nieedytowalnego do formatu edytowalnego w takich programach jak: ID, AI, PS, Word, PowerPoint.",
  "Working on multi-language files (more than 40) including Arabic, Burmese, China etc.": "Praca na wielojęzycznych plikach (ponad 40) wliczając Arabski, Birmański, Chiński itp.",
  "DTP operator at Deisgnature": "Operator DTP w Deisgnature",
  "Multiply acepted projects on diffrent flavoures/grids.": "Powielanie zaakcetowanych plików przez klienta na inne formaty/smaki.",
  "Visual and technical proces of image (Photoshop).": "Wizaulna i techniczna obróbka zdjeć (Photoshop).",
  "Creating product visualizations (packshots, mockups).": "Tworzenie wizualizacji produktów (packshoty, mockupy).",
  "Working with customer product specycifation.": "Pracowanie na podstawie specyfikacji klienta.",
  "Preparing print file with printhouse specyfication.": "Przygotowanie plików na podstawie specyfikacji drukarni.",
  "Marketing Specialist at SM Mlekovita": "Specialista ds. marketingu w SM Mlekovita",
  "Creating graphic designs and preparing them for print.": "Tworzenie projektów i wysyłanie ich do druku.",
  "Coordinating the proces acceptation of soft-proofs and proofs.": "Koordynowanie procesu akceptacji soft-proofów oraz proofów.",
  "Coordinating the proces of implentation of change on mark products such as: Jeronimo and Lidl.": "Koordynowanie procesu implementacji zmian w produktach takich mark jak: Jeronimo i Lidl.",
  "Marketing Referent - Graphic Designer at SM Mlekovita": "Referent ds. Marketing - grafik komputerowy w SM Mlekovita",
  "Helping with documentation of projects.": "Pomoc przy dokumentacji projektowej.",
  "Implentation of change on existed products.": "Implementacja zmian na obencych już produktach.",
  "Creating graphic designs.": "Tworzenie projektów graficznych.",
  "Making product photos for catalogs or leaflets.": "Robienie zdjęć produktów do katalogów i ulotek oraz szparowanie ich.",
  "Languages:": "Języki:",
  "GitHub code": "kod na GitHub",
  "ABOUT_ME": "Moja fascynacja frontem zaczęła się ponad rok temu, gdzie hobbistycznie zacząłem uczyć się HTML'a i CSS'a. Z czasem hobby zamieniło się w marzenie, aby zmienić branżę na front-end. Wtedy zacząłem uczyć się programowania gdyż sam HTML i CSS to mało. Na początku był to czysty JS, oraz drobne elementy JQuery. Jak już dobrze czułem się w JS zacząłem myśleć o frameworku. Po krótkim researchu postanowiłem wybrać jako pierwszy React, czego nie żałuję, dobrze mi się w nim pisze. Każdego dnia uczę się czegoś nowego i rozbudowuję swoje umiejętności jako frontendowiec. Myślę że dobrnąłem do etapu gdzie mogę szukać pierwszej pracy w tej branży, gdyż chciałbym już na co dzień móc zajmować się aspektami związanymi z frontem, jak i dalej rozwijać się w tym kierunku, a nie tylko w wolnych chwilach.",
  "Phone number": "Numer telefonu",
  "Linkedin profile": "Mój profil na Linkedin",
  "RODO": "Wyrażam zgodę na przetwarzanie moich danych osobowych dla potrzeb niezbędnych do realizacji procesu rekrutacji (zgodnie z Ustawą z dnia 29.08.1997 roku o Ochronie Danych Osobowych; tekst jednolity: Dz. U. 2016 r. poz. 922).",
  "CV - this project": "CV - obecny project"
}